* MICRO INVERTER ETAPA C con stm32f030K6T6
** Arranque Hardware
*** DONE Implementar DMA para el ADC
    CLOSED: [2018-07-23 Mon 11:10]
*** DONE El muestreo con TIM1 termina muy sobre el nuevo pulso
    CLOSED: [2018-07-23 Mon 12:53]
    - Corregir el tiempo de muestreo atrasando o adelentando el sample time
     Lo paso a 71.5 ciclos y termina muestreando a 24KHz

*** TODO Revisar sensado de corriente - parece no funcionar ok -
*** TODO Maxima tension de salida - quema el diodo FR307 -
    - Agregar red Snubber???
*** TODO Soft start del filtro para Vout a traves de dmax y Vin [2/2]
    - [X] definir dmax segun la tension de entrada CORREGIR de 20 a 25V tiene el valor de 20
    - [X] revisar Vout en funcion de dmax con algo de carga

*** TODO Temas del PID
    - Con un valor fijo de d; ejemplo d = 100 y Vout = 0, sin carga, salta la proteccion de 
      corriente
    - Podria implementar un d delta de 5 puntos maximo, para que no avance tan rapido
    - Me ayuda tambien con el Soft Start

*** TODO Con corriente en QB salta proteccion de QA
    - 24-07-18 Mejore la pista con cable de red, el sensado ya no pasa por debajo del transformador
    - 24-07-18 Ahora no aparecen pulsos en de corriente en QB
*** La bobina de salida ve una diferencia de tension muy alta en arranque
    - definir dmax respecto de la bobina de salida
      Vout trafo * Ton = I * Lm
** Info por el puerto serie
*** Por el puerto serie debiera enviar info
    - [ ] potencia estimada
    - [ ] error estimado
    - [ ] maximo pwm que esta permitiendo
    - [ ] d actual q1 y q2
    - [ ] tension de entrada sensada
    - [ ] info de corriente (medida q1 y q2 o algo asi)

** DONE Mensaje de Bienvenida
   CLOSED: [2018-07-23 Mon 12:18]


* Cambios Hard Version 1.0
** Para el sensado V_Sense
   - cambiar FOD814 por KB817
   - R5 de 820K pasar a M7 y 820K
   - R8 de 27K a 18K
*** Por que hice lo anterior, el 814no funcionaba????

** quite capacitores del filtro
   - quite C3 y C4 para fucionar con inverter 50Hz
     se cargan y generan una corriente en el sentido inverso que hace saltar la proteccion
     de corriente.

** Agregue C // a C15 y C16
   - para funcionar en 50Hz necesito mas tiempo activo el boost

** Para senoidal pura
   - Puedo colocar C3 de 0.1uF o 0.22uF
     parace que como el ciclo termina en 0 el C se descarga y no trae tantos problemas de corriente

** Cambie R38 R39 para mayor corriente inicial
   - en R38 y R39 puse 2k7
   - en R36 y R37 330 ohms
     esto me da 9A pico y me deja arrancar bien con lamparas halogenas

** AC Sync
   - IC1 queda detectando ints cuando se desconectan los 220Vac
   - meter un capacitor de 1n a mas en el transistor del opto
   - o bajar la R de pullup (ahora es interna)

*** aparentemente el error anterior era un micro algo quemado!

** HAY QUE METER CRISTAL!!!!

* Modos de Funcionamiento
** Inversor
** Inversor con realim de corriente
** Inversor Conectado a la Red

* Estados del Programa Principal (Inversor)
** Init
** Generting
** Error Overcurrent

* Estados del Programa Principal (Inversor con realim corriente)
** Init
** Generting
   - aca es lo mismo que lo anterior pero realimento
     por corriente en la carga en vez de poner open loop la tension

** Error Overcurrent


* Estados del Programa Principal (Inversor Conectado a la Red)
** Init
** Wait For Sync
** Generting
** Error Overcurrent
** Error Islanding

* Modulo de Sync especial
** AC Sync mide en ambos sentidos
** Buffer circular de 32
*** Revisar cada nueva medicion del circuito sync contra el buffer circular
    - errores mayores a 2% cortar generador
    - comparar t1 y t2 con int que mide UP DWN

*** Como generar el nuevo sync
    - viene un ciclo atrasado
    - revisar t1 y t2, dentro del 2%
    - luego de un UP flanco en t1 + t2/2
    - luego de un DWN flanco en t1 + t2/2

*** El sentido de los ciclos determinarlos con el opto de medicion de tension

* Mediciones 16-10-19
** ADC + DMA + TIM
*** Tiempo teorico de conversion ADC con DMA
    - tiempo de conversion por canal 12bits (sample_time + 12.5) * tick
    - tiempo de conversion por canal 10bits (sample_time + 10.5) * tick
    - tiempo de conversion por canal 8bits (sample_time + 8.5) * tick

      | Resolution | Sample Time[samples] | Channels | Clk Freq [MHz] | Time to end [us] |
      |------------+----------------------+----------+----------------+------------------|
      |         10 |                 71.5 |        3 |             12 |             20.5 |
      |            |                      |          |                |                  |
      #+TBLFM: @2$5=((@2$1+0.5+@2$2)*@2$3/@2$4)

*** Tiempo teorico de toma de resultados
    - Los resultados (valores ADC) no los tomo justo en el tiempo de conversion,
      sino como multiplo del timer que dispara las conversiones
    - Este tiempo "real" de muestreo es el minimo multiplo del timer que supera al 
      tiempo del ADC
    
    - min(Ttim * n) > Tadc

   | freq TIM3 | Ttim[us] | Tadc [us] | Multiplo | T seq_ready [us] | F seq_ready [KHz] |
   |-----------+----------+-----------+----------+------------------+-------------------|
   | 12KHz     |    83.33 |      20.5 |        1 |            83.33 |         12.000480 |
   | 24KHz     |    41.66 |      20.5 |        1 |            41.66 |         24.003841 |
   | 48KHz     |    20.83 |      20.5 |        1 |            20.83 |         48.007681 |
   | 70KHz     |    14.28 |      20.5 |        2 |            28.56 |         35.014006 |
   |           |          |           |          |                  |                   |
   #+TBLFM: @2$5=(@2$2*@2$4)::@3$5=(@3$2*@3$4)::@4$5=(@4$2*@4$4)::@5$5=(@5$2*@5$4)
   #+TBLFM: @2$6=1000/@2$5::@3$6=1000/@3$5::@4$6=1000/@4$5::@5$6=1000/@5$5

** Sensado de Tensiones vistos por el micro
   - las tensiones las puedo verificar por puerto serie

     | Resolution | Sample Time[samples] | Channels | Clk Freq [MHz] |
     |------------+----------------------+----------+----------------|
     |         10 |                 71.5 |        3 |             12 |

     | Sensed Channel | Applied Voltage | Relation [pts/V] |
     |----------------+-----------------+------------------|
     | V_Sense        |           12.63 |        34.686876 |
     | I_Sense_Pos    |            34.7 |        24.152601 |
     | I_Sense_Neg    |            34.7 |        24.152601 |

     #+TBLFM:


* Cambios 23-10-19
** Para poder Generar con el modo INVERTER_MODE_VOLTAGE_FDBK
   - tuve que cambiar el KB817, M7 y la Rpol
     por un KB814 Rpol=330K y Rsensado=2k7

** Para sincronizar los cambios anteriores no me sirven
   - pierdo la info de la polaridad, tengo que volver a un KB817
